{
  "Version": "1.3",
  "ID": "f1tad3kr3p7bkwzhtfbpiseragsch7qeeyi2szvua",
  "Issue Number": "46",
  "Client": {
    "Name": "openneuro.org",
    "Region": "United States",
    "Industry": "Life Science / Healthcare",
    "Website": "http://openneuro.org",
    "Social Media": "OpenNeuro",
    "Social Media Type": "Twitter",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "D&D Tech is a technology company based in Hong Kong. We specialize in data storage, data encryption. Is a participant and builder of Filecoin and IPFS.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "OpenNeuro is a database of openly-available brain imaging data. The data are shared according to a Creative Commons CC0 license, providing a broad range of brain imaging data to researchers and citizen scientists alike. The database primarily focuses on functional magnetic resonance imaging (fMRI) data, but also includes other imaging modalities including structural and diffusion MRI, electroencephalography (EEG), and magnetoencephalograpy (MEG). OpenfMRI is a project of the Center for Reproducible Neuroscience at Stanford University. Development of the OpenNeuro resource has been funded by the National Science Foundation, National Institute of Mental Health, National Institute on Drug Abuse, and the Laura and John Arnold Foundation.",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "We used the Go language to develop a set of tools that automatically download, cut, package data, and place orders. The tool will download the data set file from AWS, package the data set into a car file of the corresponding size by setting parameters such as sector size, and then distribute the car file to each SP through bandwidth and hard disk mail. Then, we use Boost to issue orders offline to let the SP start packaging using the Lotus program.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "aws s3 ls --no-sign-request s3://openneuro.org/  114.8 TiB\n\nI will process the data according to the directory structure. Considering that the size of each sector of filecoin is fixed at 32GiB, and the size of the car file I packaged is between 20GiB and 30GiB, it will take up more space. Therefore, I will apply for a 150TiB backup for this data.",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "South America, Greater China, Asia other than Greater China, Europe",
    "How will you be distributing your data to storage providers": "Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03315260 Germany\nf03559187 United States\nf03603117 United States\nf03619143 HongKong\nf03619150 Singapore\nf03607310 Brazil\nf03099666 Brazil",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "1PiB",
    "Single Size Dataset": "150TiB",
    "Replicas": 7,
    "Weekly Allocation": "1PiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-07-29 04:09:09.403082353 UTC",
    "Validated By": "FroghubMan",
    "Active": true,
    "Updated At": "2025-07-29 04:09:09.403078673 UTC",
    "Active Request ID": "7b7fd3d0-347b-4b48-88a9-8f36126867f4",
    "On Chain Address": "f1tad3kr3p7bkwzhtfbpiseragsch7qeeyi2szvua",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "7b7fd3d0-347b-4b48-88a9-8f36126867f4",
      "Request Type": "First",
      "Created At": "2025-07-29 04:02:49.416318541 UTC",
      "Updated At": "2025-07-29 04:02:49.416319628 UTC",
      "Active": false,
      "Allocation Amount": "281474976710656 B",
      "Signers": [
        {
          "Github Username": "FroghubMan",
          "Signing Address": "f1l7ous5nwhksx3wvg772z4i6lyiostrsejijpizq",
          "Created At": "2025-07-29 04:09:05.215000000 UTC",
          "Message CID": "bafy2bzaceawuikw3cif3uqxovicqdcrlfvn64kqbjmsjf3l6jnh4xtnae5wmq"
        }
      ]
    }
  ]
}